package com.javarush.task.task01.task0126;

/* 
Не хочешь  - решай нехотя
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.print("Хочешь - решай задачи, не хочешь - решай нехотя");
    }
}
